app/views/clubs/_form.html.erb

SELECT `cities`.* FROM `cities`
---
    <%= form.label :city_name %>
    <%= form.collection_select :city_id, City.all, :id, :name %>