app/views/clubs/index.html.erb

        <td><%= club.telephone_number %></td>
        <td><%= City.find(club.city_id).name if City.find(club.city_id).name %></td>
---
SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 2 LIMIT 1