app/controllers/cities_controller.rb

  def index
    @cities = City.all
---
SELECT `cities`.* FROM `cities`

  def create
    @city = City.new(city_params)

    respond_to do |format|
      if @city.save
---
INSERT INTO `cities` (`name`, `created_at`, `updated_at`) VALUES ('Bangalore', '2018-12-20 15:54:37', '2018-12-20 15:54:37')

  def update
    respond_to do |format|
      if @city.update(city_params)
---
UPDATE `cities` SET `name` = 'Bengaluru', `updated_at` = '2018-12-20 15:54:56' WHERE `cities`.`id` = 1

    def set_city
      @city = City.find(params[:id])
---
SELECT  `cities`.* FROM `cities` WHERE `cities`.`id` = 1 LIMIT 1