app/controllers/clubs_controller.rb

SELECT `clubs`.* FROM `clubs`
---
  def index
    @clubs = Club.all

INSERT INTO `clubs` (`name`, `address`, `telephone_number`, `created_at`, `updated_at`) VALUES ('Andhra Club', '#27, South Boag Road, T Nagar, Chennai', '044-24467671', '2018-12-20 15:48:57', '2018-12-20 15:48:57')
---
  def create
    @club = Club.new(club_params)

    respond_to do |format|
      if @club.save

UPDATE `clubs` SET `name` = 'Lion\'s Club', `updated_at` = '2018-12-21 15:38:30' WHERE `clubs`.`id` = 2
---
  def update
    respond_to do |format|
      #render plain: club_params

      if @club.update(club_params)

SELECT  `clubs`.* FROM `clubs` WHERE `clubs`.`id` = 1 LIMIT 1
---
    def set_club
      @club = Club.find(params[:id])