app/views/cities/show.html.erb

SELECT `clubs`.* FROM `clubs` WHERE `clubs`.`city_id` = 1
---
</tr>
<% @city.clubs.each do |club| %>